Ans 1:-//SAMPLE JOB(TESTJCL,XXXXXX),CLASS = A,MSGCLASS = C
//STEP1  EXEC PGM = IDCAMS
//IN  DD DSN = MY.VSAM.KSDSFILE,DISP = SHR
//OUT DD DSN = MY.VSAM1.KSDSFILE,DISP = SHR
//SYSPRINT DD  SYSOUT = *
//SYSIN DD  *
   REPRO INFILE(IN) 
      OUTFILE(OUT)
      FROMKEY(KEY1)
      TOKEY(KEY2)
/*

Ans 2:-//SAMPLE JOB(TESTJCL,XXXXXX),CLASS = A,MSGCLASS = C
//STEP1  EXEC PGM = IDCAMS
//IN  DD DSN = MY.VSAM.KSDSFILE,DISP = SHR
//OUT DD DSN = MY.VSAM1.KSDSFILE,DISP = SHR
//SYSPRINT DD  SYSOUT = *
//SYSIN DD  *
   REPRO INFILE(IN) 
      OUTFILE(OUT)
      FROMADDRESS(AD1)
      TOADDRESS(AD2)
/*

Ans 3:-//SAMPLE JOB(TESTJCL,XXXXXX),CLASS = A,MSGCLASS = C
//STEP1  EXEC PGM = IDCAMS
//IN  DD DSN = MY.VSAM.KSDSFILE,DISP = SHR
//OUT DD DSN = MY.VSAM1.KSDSFILE,DISP = SHR
//SYSPRINT DD  SYSOUT = *
//SYSIN DD  *
   REPRO INFILE(IN) 
      OUTFILE(OUT)
      FROMADDRESS(AD1)
      TOADDRESS(AD2)
/*

Ans 4:-//KSDSGDG  EXEC  PGM=IDCAMS                              
//SYSPRINT DD  SYSOUT=*                                  
//KSDSFILE DD  DSN=PAYT.PAYROLL.PROCESS.KEYFILE,         
//             DISP=SHR                                  
//GDGFILE  DD  DSN=PAYT.PAYROLL.PROCESS.KEYFILE.BKUP(+1),
//             DISP=(NEW,CATLG),                         
//             UNIT=SYSDA,SPACE=(CYL,(10,10),RLSE),      
//             DCB=(MODEL.GDG,RECFM=FB,LRECL=325)        
//SYSIN    DD  *                                         
 REPRO INFILE(KSDSFILE) OUTFILE(GDGFILE) -
 SKIP(5) COUNT(10)       
/*

Ans 5:-